avmwww/ittrium/config/tms320c55x/tms320c55x.h
#ifndef _TMS320C55_H_
#define _TMS320C55_H_

/*******************************************************************************
 External bus selection register
 *******************************************************************************/
#define EBSR         (*((volatile ioport int*)0x6C00))

#define IVPD         (*(volatile int*)0x0049)
#define IVPH         (*(volatile int*)0x004A)

/*******************************************************************************
 Clock Mode Register
 *******************************************************************************/
#define CLKMD         (*(volatile ioport int*)0x1C00)
// Mask
#define CLKMD_IAI               0x4000
#define CLKMD_IOB               0x2000
#define CLKMD_TEST              0x1000
#define CLKMD_PLL_MULT          0x0F80
#define CLKMD_PLL_DIV           0x0060
#define CLKMD_PLL_ENABLE        0x0010
#define CLKMD_BYPASS DIV        0x000C
#define CLKMD_BREAKLN           0x0002
#define CLKMD_LOCK              0x0001
// Bits
#define _CLKMD_IAI_             14
#define _CLKMD_IOB_             13
#define _CLKMD_TEST_            12
#define _CLKMD_PLL_MULT_         7
#define _CLKMD_PLL_DIV_          5
#define _CLKMD_PLL_ENABLE_       4
#define _CLKMD_BYPASS_DIV_       2
#define _CLKMD_BREAKLN_          1
#define _CLKMD_LOCK_             0
/*******************************************************************************
 EMIF module
 *******************************************************************************/
#define EGCR               (*(volatile ioport int*)0x0800) // EMIF Global Control Register xxxx xxxx 0010 xx00
#define EMI_RST            (*(volatile ioport int*)0x0801) // EMIF Global Reset Register xxxx xxxx xxxx xxxx
#define EMI_BE             (*(volatile ioport int*)0x0802) // EMIF Bus Error Status Register xx00 0000 0000 0000
#define CE0_1              (*(volatile ioport int*)0x0803) // EMIF CE0 Space Control Register 1 x010 1111 1111 1111
#define CE0_2              (*(volatile ioport int*)0x0804) // EMIF CE0 Space Control Register 2 0100 1111 1111 1111
#define CE0_3              (*(volatile ioport int*)0x0805) // EMIF CE0 Space Control Register 3 xxxx xxxx 0000 0000
#define CE1_1              (*(volatile ioport int*)0x0806) // EMIF CE1 Space Control Register 1 x010 1111 1111 1111
#define CE1_2              (*(volatile ioport int*)0x0807) // EMIF CE1 Space Control Register 2 0100 1111 1111 1111
#define CE1_3              (*(volatile ioport int*)0x0808) // EMIF CE1 Space Control Register 3 xxxx xxxx 0000 0000
#define CE2_1              (*(volatile ioport int*)0x0809) // EMIF CE2 Space Control Register 1 x010 1111 1111 1111
#define CE2_2              (*(volatile ioport int*)0x080A) // EMIF CE2 Space Control Register 2 0101 1111 1111 1111
#define CE2_3              (*(volatile ioport int*)0x080B) // EMIF CE2 Space Control Register 3 xxxx xxxx 0000 0000
#define CE3_1              (*(volatile ioport int*)0x080C) // EMIF CE3 Space Control Register 1 x010 1111 1111 1111
#define CE3_2              (*(volatile ioport int*)0x080D) // EMIF CE3 Space Control Register 2 0101 1111 1111 1111
#define CE3_3              (*(volatile ioport int*)0x080E) // EMIF CE3 Space Control Register 3 xxxx xxxx 0000 0000
#define SDC1               (*(volatile ioport int*)0x080F) // EMIF SDRAM Control Register 1 1111 1001 0100 1000
#define SDPER              (*(volatile ioport int*)0x0810) // EMIF SDRAM Period Register xxxx 0000 1000 0000
#define SDCNT              (*(volatile ioport int*)0x0811) // EMIF SDRAM Counter Register xxxx 0000 1000 0000
#define EMIF_INIT          (*(volatile ioport int*)0x0812) // EMIF SDRAM Init Register xxxx xxxx xxxx xxxx
#define SDC2               (*(volatile ioport int*)0x0813) // EMIF SDRAM Control Register 2 xxxx xx11 1111 1111
#define SDC3               (*(volatile ioport int*)0x0814) // EMIF SDRAM Control Register 3 0000 0000 0000 0111
/*---------------------------------------------------*
 * EGCR register                                     *
 * --------------------------------------------------*/
#define EGCR_MEMFREQ(x)         (((x)&3)<<9)
#define EGCR_WPE                0x0080
#define EGCR_MEMCEN             0x0020
#define EGCR_ARDYOFF            0x0010
#define EGCR_ARDY               0x0008
#define EGCR_HOLD               0x0004
#define EGCR_HOLDA              0x0002
#define EGCR_NOHOLD             0x0001
/*---------------------------------------------------*
 * EMI_BE Register                                   *
 * --------------------------------------------------*/
#define EMI_BE_EMITIME           0x1000
#define EMI_BE_EMICE3            0x0400
#define EMI_BE_EMICE2            0x0200
#define EMI_BE_EMICE1            0x0100
#define EMI_BE_EMICE0            0x0080
#define EMI_BE_EMIDMA            0x0040
#define EMI_BE_EMIFBUS           0x0020
#define EMI_BE_EMIEBUS           0x0010
#define EMI_BE_EMIDBUS           0x0008
#define EMI_BE_EMICBUS           0x0004
#define EMI_BE_EMIPBUS           0x0001
/*---------------------------------------------------*
 * CEn_1, CEn_2, CEn_3 Registers ( n = 1, 2, 3 )     *
 * --------------------------------------------------*/
// CEn_1
#define  CEn_1_MTYPE(x)          (((x)&7)<<12)
#define  CEn_1_READ_SETUP(x)     (((x)&0xF)<<8)
#define  CEn_1_READ_STROBE(x)    (((x)&0x1F)<<2)
#define  CEn_1_READ_HOLD(x)      (((x)&3))
// CEn_2
#define  CEn_2_READ_EXT_HOLD(x)  (((x)&3)<<14)
#define  CEn_2_WRITE_EXT_HOLD(x) (((x)&3)<<12)
#define  CEn_2_WRITE_SETUP(x)    (((x)&0xF)<<8)
#define  CEn_2_WRITE_STROBE(x)   (((x)&0x1F)<<2)
#define  CEn_2_WRITE_HOLD(x)     (((x)&3))
// CEn_3
#define CEn_3_EMITIMEOUT(x)      (x&0xFF)
#if 0
/* --------------------------------------------------*
 * SDC1                                              *
 * --------------------------------------------------*/
#define SDC1
                  .asg "<<11", SDC1_TRC
#define SDC1_4M_16        0x0000
#define SDC1_8M_16        0x0400
#define SDC1_RFEN         0x0100
                  .asg "<<4", SDC1_TRCD
                  .asg " ", SDC1_TRP
/* --------------------------------------------------*
 * SDC2                                              *
 * --------------------------------------------------*/
SDC2_SDACC        .equ 0x4000
                  .asg "<<8", SDC2_TMRD
                  .asg "<<4", SDC2_TRAS
                  .asg " "  , SDC2_TACTV2ACTV
#endif
/*******************************************************************************
 I2C MODULE REGISTERS
 *******************************************************************************/
#define I2CMDR        (*(volatile ioport int*)0x3C09)   // I2C Mode Register
#define I2CIER        (*(volatile ioport int*)0x3C01)   // I2C Interrupt Enable Register
#define I2CSTR        (*(volatile ioport int*)0x3C02)   // I2C Status Register
#define I2CISRC       (*(volatile ioport int*)0x3C0A)   // I2C Interrupt Source Register
#define I2CPSC        (*(volatile ioport int*)0x3C0C)   // I2C Prescaler Register
#define I2CCLKL       (*(volatile ioport int*)0x3C03)   // I2C Clock Divider Low Register
#define I2CCLKH       (*(volatile ioport int*)0x3C04)   // I2C Clock Divider High Register
#define I2CSAR        (*(volatile ioport int*)0x3C07)   // I2C Slave Address Register
#define I2COAR        (*(volatile ioport int*)0x3C00)   // I2C Own Address Register
#define I2CCNT        (*(volatile ioport int*)0x3C05)   // I2C Data Count
#define I2CDRR        (*(volatile ioport int*)0x3C06)   // I2C Data Receive Register
#define I2CDXR        (*(volatile ioport int*)0x3C08)   // I2C Data Transmit Register
#define I2CGPIO       (*(volatile ioport int*)0x3C0B)   // I2C General-Purpose Register
/*-----------------------------------------------------------------------------*
  I2CMDR
 *-----------------------------------------------------------------------------*/
// Bits
#define _I2CMDR_NACKMOD_   15
#define _I2CMDR_FREE_      14
#define _I2CMDR_STT_       13
#define _I2CMDR_IDLEEN_    12
#define _I2CMDR_STP_       11
#define _I2CMDR_MST_       10
#define _I2CMDR_TRX_        9
#define _I2CMDR_XA_         8
#define _I2CMDR_RM_         7
#define _I2CMDR_DLB_        6
#define _I2CMDR_IRS_        5
#define _I2CMDR_STB_        4
#define _I2CMDR_FDF_        3
#define _I2CMDR_BC_         0
// Mask
#define I2CMDR_NACKMOD    0x8000
#define I2CMDR_FREE       0x4000
#define I2CMDR_STT        0x2000
#define I2CMDR_IDLEEN     0x1000
#define I2CMDR_STP        0x0800
#define I2CMDR_MST        0x0400
#define I2CMDR_TRX        0x0200
#define I2CMDR_XA         0x0100
#define I2CMDR_RM         0x0080
#define I2CMDR_DLB        0x0040
#define I2CMDR_IRS        0x0020
#define I2CMDR_STB        0x0010
#define I2CMDR_FDF        0x0008
#define I2CMDR_BC         0x0007
/*-----------------------------------------------------------------------------*
  I2CIER
 *-----------------------------------------------------------------------------*/
// Bits
#define _I2CIER_XRDY_      4
#define _I2CIER_RRDY_      3
#define _I2CIER_ARDY_      2
#define _I2CIER_NACK_      1
#define _I2CIER_AL_        0
// Mask
#define I2CIER_XRDY       0x0010
#define I2CIER_RRDY       0x0008
#define I2CIER_ARDY       0x0004
#define I2CIER_NACK       0x0002
#define I2CIER_AL         0x0001
/*-----------------------------------------------------------------------------*
  I2CSTR
 *-----------------------------------------------------------------------------*/
// Bits
#define _I2CSTR_NACKSNT_  13
#define _I2CSTR_BB_       12
#define _I2CSTR_RSFULL_   11
#define _I2CSTR_XSMT_     10
#define _I2CSTR_AAS_       9
#define _I2CSTR_AD0_       8
#define _I2CSTR_XRDY_      4
#define _I2CSTR_RRDY_      3
#define _I2CSTR_ARDY_      2
#define _I2CSTR_NACK_      1
#define _I2CSTR_AL_        0
// Mask
#define I2CSTR_NACKSNT    0x2000
#define I2CSTR_BB         0x1000
#define I2CSTR_RSFULL     0x0800
#define I2CSTR_XSMT       0x0400
#define I2CSTR_AAS        0x0200
#define I2CSTR_AD0        0x0100
#define I2CSTR_XRDY       0x0010
#define I2CSTR_RRDY       0x0008
#define I2CSTR_ARDY       0x0004
#define I2CSTR_NACK       0x0002
#define I2CSTR_AL         0x0001
/*-----------------------------------------------------------------------------*
 I2CISRC
 *-----------------------------------------------------------------------------*/
// Bits
#define _I2CISRC_TESTMD_   8
#define _I2CISRC_INTCODE_  0
// Mask
#define I2CISRC_TESTMD     0x0F00
#define I2CISRC_INTCODE    0x0007
// I2CISRC INTCODE
#define I2CISRC_INTCODE_XRDY    5
#define I2CISRC_INTCODE_RRDY    4
#define I2CISRC_INTCODE_ARDY    3
#define I2CISRC_INTCODE_NACK    2
#define I2CISRC_INTCODE_AL      1
#define I2CISRC_INTCODE_NONE    0
/*******************************************************************************
 TIMER REGISTERS
 *******************************************************************************/
#define TIM0            (*(volatile ioport int*)0x1000) // Timer0 Count Register
#define PRD0            (*(volatile ioport int*)0x1001) // Timer0 Period Register
#define TCR0            (*(volatile ioport int*)0x1002) // Timer0 Control Register
#define PRSC0           (*(volatile ioport int*)0x1003) // Timer0 Prescaler Register
#define TIM1            (*(volatile ioport int*)0x2400) // Timer1 Count Register
#define PRD1            (*(volatile ioport int*)0x2401) // Timer1 Period Register
#define TCR1            (*(volatile ioport int*)0x2402) // Timer1 Control Register
#define PRSC1           (*(volatile ioport int*)0x2403) // Timer1 Prescaler Register
/*-----------------------------------------------------------------------------*
  TCR
 *-----------------------------------------------------------------------------*/
// Mask
#define TCR_IDLE_EN             0x8000
#define TCR_INT_EXT             0x4000
#define TCR_ERR_TIM             0x2000
#define TCR_FUNC_00             0x0000
#define TCR_FUNC_01             0x0800
#define TCR_FUNC_10             0x1000
#define TCR_FUNC_11             0x1800
#define TCR_TLB                 0x0400
#define TCR_SOFT                0x0200
#define TCR_FREE                0x0100
#define TCR_PWID_8_CPU          0x00C0
#define TCR_PWID_4_CPU          0x0080
#define TCR_PWID_2_CPU          0x0040
#define TCR_PWID_1_CPU          0x0000
#define TCR_ARB                 0x0020
#define TCR_TSS                 0x0010
#define TCR_CP                  0x0008
#define TCR_POLAR               0x0004
#define TCR_DATOUT              0x0002
// Bits
#define _TCR_IDLE_EN_           15
#define _TCR_INT_EXT_           14
#define _TCR_ERR_TIM_           13
#define _TCR_TLB_               10
#define _TCR_SOFT_              9
#define _TCR_FREE_              8
#define _TCR_ARB_               5
#define _TCR_TSS_               4
#define _TCR_C_P_               3
#define _TCR_POLAR_             2
#define _TCR_DATOUT_            1

