avmwww/ittrium/config/tms320c55x/tms320c55x.h
/*******************************************************************************
 Enable & Disable Interrupts
 *******************************************************************************/
#define ENABLE_INTERRUPT()       asm("     BCLR ST1_INTM")
#define DISABLE_INTERRUPT()      asm("     BSET ST1_INTM")

#define ENABLE_TIMER1_INT()      asm("     OR #1<<6, *(IER1)")
#define DISABLE_TIMER1_INT()     asm("     AND #~(1<<6), *(IER1)")

#define ENABLE_INT0_INT()        asm("     OR #0x0004, *(IER0)")
#define DISABLE_INT0_INT()       asm("     AND #~(0x0004), *(IER0)")

#define ENABLE_DMAC5_INT()       asm("     OR #0x8000, *(IER0)")
#define DISABLE_DMAC5_INT()      asm("     AND #~(0x8000), *(IER0)")

#define ENABLE_DMAC4_INT()       asm("     OR #0x4000, *(IER0)")
#define DISABLE_DMAC4_INT()      asm("     AND #~(0x4000), *(IER0)")

#define ENABLE_XINT2_INT()       asm("     OR #0x2000, *(IER0)")
#define DISABLE_XINT2_INT()      asm("     AND #~(0x2000), *(IER0)")

#define ENABLE_MMCSD2_INT()      asm("     OR #0x2000, *(IER0)")
#define DISABLE_MMCSD2_INT()     asm("     AND #~(0x2000), *(IER0)")

#define ENABLE_RINT2_INT()       asm("     OR #0x1000, *(IER0)")
#define DISABLE_RINT2_INT()      asm("     AND #~(0x1000), *(IER0)")

#define ENABLE_INT3_INT()        asm("     OR #0x0800, *(IER0)")
#define DISABLE_INT3_INT()       asm("     AND #~(0x0800), *(IER0)")

#define ENABLE_WDTINT_INT()      asm("     OR #0x0800, *(IER0)")
#define DISABLE_WDTINT_INT()     asm("     AND #~(0x0800), *(IER0)")

#define ENABLE_DSPINT_INT()      asm("     OR #0x0400, *(IER0)")
#define DISABLE_DSPINT_INT()     asm("     AND #~(0x0400), *(IER0)")

#define ENABLE_DMAC1_INT()       asm("     OR #0x0200, *(IER0)")
#define DISABLE_DMAC1_INT()      asm("     AND #~(0x0200), *(IER0)")

#define ENABLE_USB_INT()         asm("     OR #0x0100, *(IER0)")
#define DISABLE_USB_INT()        asm("     AND #~(0x0100), *(IER0)")

#define ENABLE_XINT1_INT()       asm("     OR #0x0080, *(IER0)")
#define DISABLE_XINT1_INT()      asm("     AND #~(0x0080), *(IER0)")

#define ENABLE_MMCSD1_INT()      asm("     OR #0x0080, *(IER0)")
#define DISABLE_MMCSD1_INT()     asm("     AND #~(0x0080), *(IER0)")

#define ENABLE_RINT1_INT()       asm("     OR #0x0040, *(IER0)")
#define DISABLE_RINT1_INT()      asm("     AND #~(0x0040), *(IER0)")

#define ENABLE_RINT0_INT()       asm("     OR #0x0020, *(IER0)")
#define DISABLE_RINT0_INT()      asm("     AND #~(0x0020), *(IER0)")

#define ENABLE_TINT0_INT()       asm("     OR #0x0010, *(IER0)")
#define DISABLE_TINT0_INT()      asm("     AND #~(0x0010), *(IER0)")

#define ENABLE_INT2_INT()       asm("     OR #0x0008, *(IER0)")
#define DISABLE_INT2_INT()      asm("     AND #~(0x0008), *(IER0)")

#define ENABLE_INT0_INT()       asm("     OR #0x0004, *(IER0)")
#define DISABLE_INT0_INT()      asm("     AND #~(0x0004), *(IER0)")

//------------------------------------------------------------------------------
#define ENABLE_RTOS_INT()       asm("     OR #0x0400, *(IER1)")
#define DISABLE_RTOS_INT()      asm("     AND #~(0x0400), *(IER1)")

#define ENABLE_DLOG_INT()       asm("     OR #0x0200, *(IER1)")
#define DISABLE_DLOG_INT()      asm("     AND #~(0x0200), *(IER1)")

#define ENABLE_BERR_INT()       asm("     OR #0x0100, *(IER1)")
#define DISABLE_BERR_INT()      asm("     AND #~(0x0100), *(IER1)")

#define ENABLE_I2C_INT()        asm("     OR #0x0080, *(IER1)")
#define DISABLE_I2C_INT()       asm("     AND #~(0x0080), *(IER1)")

#define ENABLE_TINT1_INT()      asm("     OR #0x0040, *(IER1)")
#define DISABLE_TINT1_INT()     asm("     AND #~(0x0040), *(IER1)")

#define ENABLE_DMAC3_INT()      asm("     OR #0x0020, *(IER1)")
#define DISABLE_DMAC3_INT()     asm("     AND #~(0x0020), *(IER1)")
#define CLEAR_DMAC3_INT()       asm("     OR #0x0020, *(IFR1)");

#define ENABLE_DMAC2_INT()      asm("     OR #0x0010, *(IER1)")
#define DISABLE_DMAC2_INT()     asm("     AND #~(0x0010), *(IER1)")
#define CLEAR_DMAC2_INT()       asm("     OR #0x0010, *(IFR1)");

#define ENABLE_INT4_INT()       asm("     OR #0x0008, *(IER1)")
#define DISABLE_INT4_INT()      asm("     AND #~(0x0008), *(IER1)")

#define ENABLE_RTC_INT()        asm("     OR #0x0008, *(IER1)")
#define DISABLE_RTC_INT()       asm("     AND #~(0x0008), *(IER1)")

#define ENABLE_DMAC0_INT()      asm("     OR #0x0004, *(IER1)")
#define DISABLE_DMAC0_INT()     asm("     AND #~(0x0004), *(IER1)")

#define ENABLE_XINT0_INT()      asm("     OR #0x0002, *(IER1)")
#define DISABLE_XINT0_INT()     asm("     AND #~(0x0002), *(IER1)")

#define ENABLE_INT1_INT()       asm("     OR #0x0001, *(IER1)")
#define DISABLE_INT1_INT()      asm("     AND #~(0x0001), *(IER1)")
/*******************************************************************************
 Vector Interrupts
 *******************************************************************************/
#define RESET_INT_VEC_NO         0
#define SINT0                    0 // Reset (hardware and software)

#define NMI_INT_VEC_NO           1
#define SINT1                    1 // Nonmaskable interrupt

#define BERR_INT_VEC_NO         24
#define SINT24                  24 // Bus Error interrupt

#define INT0_INT_VEC_NO          2
#define SINT2                    2 // External interrupt #0

#define INT1_INT_VEC_NO         16
#define SINT16                  16 // External interrupt #1

#define INT2_INT_VEC_NO          3
#define SINT3                    3 // External interrupt #2

#define TINT0_INT_VEC_NO         4
#define SINT4                    4 // Timer #0 interrupt

#define RINT0_INT_VEC_NO         5
#define SINT5                    5 // McBSP #0 receive interrupt

#define XINT0_INT_VEC_NO        17
#define SINT17                  17 // McBSP #0 transmit interrupt

#define RINT1_INT_VEC_NO         6
#define SINT6                    6 // McBSP #1 receive interrupt

#define XINT1_INT_VEC_NO         7
#define MMCSD1_INT_VEC_NO        7
#define SINT7                    7 // McBSP #1 transmit interrupt, MMC/SD #1 interrupt

#define USB_INT_VEC_NO           8
#define SINT8                    8 // USB interrupt

#define DMAC0_INT_VEC_NO        18
#define SINT18                  18 // DMA Channel #0 interrupt

