avmwww/ittrium/config/tms320c55x/tms320c55x.h
#define DMAC1_INT_VEC_NO         9
#define SINT9                    9 // DMA Channel #1 interrupt

#define DSPINT_INT_VEC_NO       10
#define SINT10                  10 // Interrupt from host

#define INT3_INT_VEC_NO         11
#define WDTINT_INT_VEC_NO       11
#define SINT11                  11 // External interrupt #3 or Watchdog timer interrupt

#define INT4_INT_VEC_NO         19
#define RTC_INT_VEC_NO          19
#define SINT19                  19 // External interrupt #4 or RTC interrupt

#define RINT2_INT_VEC_NO        12
#define SINT12                  12 // McBSP #2 receive interrupt

#define XINT2_INT_VEC_NO        13
#define MMCSD2_INT_VEC_NO       13
#define SINT13                  13 // McBSP #2 transmit interrupt , MMC/SD #2 interrupt

#define DMAC2_INT_VEC_NO        20
#define SINT20                  20 // DMA Channel #2 interrupt

#define DMAC3_INT_VEC_NO        21
#define SINT21                  21 // DMA Channel #3 interrupt

#define DMAC4_INT_VEC_NO        14
#define SINT14                  14 // DMA Channel #4 interrupt

#define DMAC5_INT_VEC_NO        15
#define SINT15                  15 // DMA Channel #5 interrupt

#define TINT1_INT_VEC_NO        22
#define SINT22                  22 //  Timer #1 interrupt

#define I2C_INT_VEC_NO          23
#define IIC_INT_VEC_NO          23
#define SINT23                  23 // I2C interrupt

#define DLOG_INT_VEC_NO         25
#define SINT25                  25 // Data Log interrupt

#define RTOS_INT_VEC_NO         26
#define SINT26                  26 // Real-time Operating System interrupt

#define SINT27                  27 // Software interrupt #27
#define SINT28                  28 // Software interrupt #28
#define SINT29                  29 // Software interrupt #29
#define SINT30                  30 // Software interrupt #30
#define SINT31                  31 // Software interrupt #31

/*******************************************************************************
 * USB Module
 *******************************************************************************/
// USB PLL Clock Generator
#define USBCLKMD        (*(volatile ioport int*)0x1E00)
// USBCLKMD
#define USBCLKMD_PLL_ENABLE   0x10
#define USBCLKMD_PLL_DIV(d)   ((d)<<5)
#define USBCLKMD_PLL_MULT(m)  ((m)<<7)
/*
// DMA CONTEXT
// 0x5800 Reserved
DMAC_O1                    .equ 0x5808 ;Output Endpoint 1 DMA Context
DMAC_O2                    .equ 0x5810 ;Output Endpoint 2 DMA Context
DMAC_O3                    .equ 0x5818 ;Output Endpoint 3 DMA Context
DMAC_O4                    .equ 0x5820 ;Output Endpoint 4 DMA Context
DMAC_O5                    .equ 0x5828 ;Output Endpoint 5 DMA Context
DMAC_O6                    .equ 0x5830 ;Output Endpoint 6 DMA Context
DMAC_O7                    .equ 0x5838 ;Output Endpoint 7 DMA Context
//0x5840 Reserved
DMAC_I1                    0x5848 // Input Endpoint 1 DMA Context
DMAC_I2                    0x5850 // Input Endpoint 2 DMA Context
DMAC_I3                    0x5858 // Input Endpoint 3 DMA Context
DMAC_I4                    0x5860 // Input Endpoint 4 DMA Context
DMAC_I5                    0x5868 // Input Endpoint 5 DMA Context
DMAC_I6                    0x5870 // Input Endpoint 6 DMA Context
DMAC_I7                    0x5878 // Input Endpoint 7 DMA Context
USB_DATA_BUFF              0x5880 // Contains X/Y data buffers for endpoints 1 - 7
// BUFFER RAM
OEB_0                      0x6680 // Output Endpoint 0 Buffer
IEB_0                      0x66C0 // Input Endpoint 0 Buffer
SUP_0                      0x6700 // Setup Packet for Endpoint
OEDB_1                     0x6708 // Output Endpoint 1 Descriptor Block
OEDB_2                     0x6710 // Output Endpoint 2 Descriptor Block
OEDB_3                     0x6718 // Output Endpoint 3 Descriptor Block
OEDB_4                     0x6720 // Output Endpoint 4 Descriptor Block
OEDB_5                     0x6728 // Output Endpoint 5 Descriptor Block
OEDB_6                     0x6730 // Output Endpoint 6 Descriptor Block
OEDB_7                     0x6738 // Output Endpoint 7 Descriptor Block
// 0x6740 Reserved
IEDB_1                     0x6748 // Input Endpoint 1 Descriptor Block
IEDB_2                     0x6750 // Input Endpoint 2 Descriptor Block
IEDB_3                     0x6758 // Input Endpoint 3 Descriptor Block
IEDB_4                     0x6760 // Input Endpoint 4 Descriptor Block
IEDB_5                     0x6768 // Input Endpoint 5 Descriptor Block
IEDB_6                     0x6770 // Input Endpoint 6 Descriptor Block
IEDB_7                     0x6778 // Input Endpoint 7 Descriptor Block
// CONTROL AND STATUS REGISTERS
IEPCNF_0                   0x6780 Input Endpoint 0 Configuration
IEPBCNT_0                  0x6781 Input Endpoint 0 Byte Count
OEPCNF_0                   0x6782 Output Endpoint 0 Configuration
OEPBCNT_0                  0x6783 Output Endpoint 0 Byte Count
GLOBCTL                    0x6791 Global Control Register
VECINT                     0x6792 Vector Interrupt Register
IEPINT                     0x6793 Input Endpoint Interrupt Register
OEPINT                     0x6794 Output Endpoint Interrupt Register
IDMARINT                   0x6795 Input DMA Reload Interrupt Register
ODMARINT                   0x6796 Output DMA Reload Interrupt Register
IDMAGINT                   0x6797 Input DMA Go Interrupt Register
ODMAGINT                   0x6798 Output DMA Go Interrupt Register
IDMAMSK                    0x6799 Input DMA Interrupt Mask Register
ODMAMSK                    0x679A Output DMA Interrupt Mask Register
IEDBMSK                    0x679B Input EDB Interrupt Mask Register
OEDBMSK                    0x679C Output EDB Interrupt Mask Register
HOSTCTL                    0x67A0 Host DMA Control Register
HOSTEP                     0x67A1 Host DMA Endpoint Register
HOST                       0x67A2 Host DMA Status
FNUML                      0x67F8 Frame Number Low Register
FNUMH                      0x67F9 Frame Number High
PSOFTMR                    0x67FA PreSOF Interrupt Timer Register
//USBCTL                     0x67FC ;USB Control Register
USBMSK                     0x67FD USB Interrupt Mask Register
USBSTA                     0x67FE USB Status Register
;
USB_IDLE                   0x7000 USB idle control
*/

// Defined by spru317
#define USBREGBASE      ( (volatile ioport int*)0x5800) // Base addres of USB module registers
#define USBICNF0        (*(volatile ioport int*)0x6780) // Configuration Register for IN Endpoint 0
#define USBICT0         (*(volatile ioport int*)0x6781) // Count Register for IN Endpoint 0
#define USBOCNF0        (*(volatile ioport int*)0x6782) // Configuration Register for OUT Endpoint 0
#define USBOCT0         (*(volatile ioport int*)0x6783) // Count Register for OUT Endpoint 0
#define USBGCTL         (*(volatile ioport int*)0x6791) // Global Control Register

#define USBINTSRC       (*(volatile ioport int*)0x6792) // Interrupt Source Register
#define USBIEPIF        (*(volatile ioport int*)0x6793) // Endpoint Interrupt Flag Register for OUT Endpoints
#define USBOEPIF        (*(volatile ioport int*)0x6794) // Endpoint Interrupt Flag Register for IN Endpoints

