avmwww/ittrium/config/tms320c55x/tms320c55x.h
#define USBIEPIE        (*(volatile ioport int*)0x679B) // Endpoint Interrupt Enable Register for IN Endpoints
#define USBOEPIE        (*(volatile ioport int*)0x679C) // Endpoint Interrupt Enable Register for OUT Endpoints

#define USBCTL          (*(volatile ioport int*)0x67FC) // USB Control Register
#define USBIE           (*(volatile ioport int*)0x67FD) // USB Interrupt Enable Register
#define USBIF           (*(volatile ioport int*)0x67FE) // USB Interrupt Flag Register
#define USBIDLECTL      (*(volatile ioport int*)0x7000) // USB idle control
#define USB_EP_DATA_BUF (*(volatile ioport int*)0x5880) // Contains X/Y data buffers for endpoints 1 - 7
#define USB_SETUP_PACKET (*(volatile ioport int*)0x6700) // Setup Packet for Endpoint
#define USB_OEB_0       (*(volatile ioport int*)0x6680) // Output Endpoint 0 Buffer
#define USB_IEB_0       (*(volatile ioport int*)0x66C0) // Input Endpoint 0 Buffer
#define USBADDR         (*(volatile ioport int*)0x67FF) // USB Device Address Register
#define USBFNUML        (*(volatile ioport int*)0x67F8) // Frame Number Low
#define USBFNUMH        (*(volatile ioport int*)0x67F9) // Frame Number High

//------------------------------------------------------------------------------
// DMA context registers
//------------------------------------------------------------------------------
// addr = base + n*8
// Control register
#define USBODCTL(n)     (*(volatile ioport int*)(0x5800+(n)*8))
#define USBIDCTL(n)     (*(volatile ioport int*)(0x5840+(n)*8))
// Size register (transfer size in bytes)
#define USBODSIZ(n)     (*(volatile ioport int*)(0x5801+(n)*8))
#define USBIDSIZ(n)     (*(volatile ioport int*)(0x5841+(n)*8))
// Address register, low part (byte address for a location in DSP memory)
#define USBODADL(n)     (*(volatile ioport int*)(0x5802+(n)*8))
#define USBIDADL(n)     (*(volatile ioport int*)(0x5842+(n)*8))
// Address register, high part (byte address for a location in DSP memory)
#define USBODADH(n)     (*(volatile ioport int*)(0x5803+(n)*8))
#define USBIDADH(n)     (*(volatile ioport int*)(0x5843+(n)*8))
// Count register (transfer count in bytes)
#define USBODCT(n)      (*(volatile ioport int*)(0x5804+(n)*8))
#define USBIDCT(n)      (*(volatile ioport int*)(0x5844+(n)*8))
// Reload-size register (reload value for USBxDSIZ, x = O or I)
#define USBODRSZ(n)     (*(volatile ioport int*)(0x5805+(n)*8))
#define USBIDRSZ(n)     (*(volatile ioport int*)(0x5845+(n)*8))
// Reload-address register, low part (reload value for USBxDADL, x = O or I)
#define USBODRAL(n)     (*(volatile ioport int*)(0x5806+(n)*8))
#define USBIDRAL(n)     (*(volatile ioport int*)(0x5846+(n)*8))
// Reload-address register, high part (reload value for USBxDADH, x = O or I)
#define USBODRAH(n)     (*(volatile ioport int*)(0x5807+(n)*8))
#define USBIDRAH(n)     (*(volatile ioport int*)(0x5847+(n)*8))
//------------------------------------------------------------------------------
// USBDCTL
//------------------------------------------------------------------------------
#define USBDCTL_PM      0x0100
#define USBDCTL_EM      0x0080
#define USBDCTL_SHT     0x0040
#define USBDCTL_CAT     0x0020
#define USBDCTL_END     0x0010
#define USBDCTL_OVF     0x0008
#define USBDCTL_RLD     0x0004
#define USBDCTL_STP     0x0002
#define USBDCTL_GO      0x0001

#define _USBDCTL_PM     8
#define _USBDCTL_GO     0
//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
// DMA RLD (reload) interrupt flag register for IN endpoints
#define USBIDRIF         (*(volatile ioport int*)0x6795)
// DMA RLD (reload) interrupt flag register for OUT endpoints
#define USBODRIF         (*(volatile ioport int*)0x6796)
// DMA GO interrupt flag register for IN endpoints
#define USBIDGIF         (*(volatile ioport int*)0x6797)
// DMA GO interrupt flag register for OUT endpoints
#define USBODGIF         (*(volatile ioport int*)0x6798)
// DMA interrupt enable register for IN endpoints
#define USBIDIE          (*(volatile ioport int*)0x6799)
// DMA interrupt enable register for OUT endpoints
#define USBODIE          (*(volatile ioport int*)0x679A)
//------------------------------------------------------------------------------
// USBINTSRC
//------------------------------------------------------------------------------
#define USBINTSRC_NO_INT           0x00
#define USBINTSRC_OUT_EP_0         0x02
#define USBINTSRC_IN_EP_0          0x04
#define USBINTSRC_RSTR             0x06
#define USBINTSRC_SUSR             0x08
#define USBINTSRC_RESR             0x0A
#define USBINTSRC_SETUP            0x0C
#define USBINTSRC_STPOW            0x0E
#define USBINTSRC_SOF              0x10
#define USBINTSRC_PSOF             0x11

#define USBINTSRC_OUT_EP(n)        (((n)-1)*2 + 0x12)

#define USBINTSRC_OUT_EP_1         0x12
#define USBINTSRC_OUT_EP_2         0x14
#define USBINTSRC_OUT_EP_3         0x16
#define USBINTSRC_OUT_EP_4         0x18
#define USBINTSRC_OUT_EP_5         0x1A
#define USBINTSRC_OUT_EP_6         0x1C
#define USBINTSRC_OUT_EP_7         0x1E

#define USBINTSRC_IN_EP(n)        (((n)-1)*2 + 0x22)

#define USBINTSRC_IN_EP_1          0x22
#define USBINTSRC_IN_EP_2          0x24
#define USBINTSRC_IN_EP_3          0x26
#define USBINTSRC_IN_EP_4          0x28
#define USBINTSRC_IN_EP_5          0x2A
#define USBINTSRC_IN_EP_6          0x2C
#define USBINTSRC_IN_EP_7          0x2E
#define USBINTSRC_OUT_EP_1_DMA_RELOAD 0x32
#define USBINTSRC_OUT_EP_1_DMA_GO     0x33
#define USBINTSRC_OUT_EP_2_DMA_RELOAD 0x34
#define USBINTSRC_OUT_EP_2_DMA_GO     0x35
#define USBINTSRC_OUT_EP_3_DMA_RELOAD 0x36
#define USBINTSRC_OUT_EP_3_DMA_GO     0x37
#define USBINTSRC_OUT_EP_4_DMA_RELOAD 0x38
#define USBINTSRC_OUT_EP_4_DMA_GO     0x39
#define USBINTSRC_OUT_EP_5_DMA_RELOAD 0x3A
#define USBINTSRC_OUT_EP_5_DMA_GO     0x3B
#define USBINTSRC_OUT_EP_6_DMA_RELOAD 0x3C
#define USBINTSRC_OUT_EP_6_DMA_GO     0x3D
#define USBINTSRC_OUT_EP_7_DMA_RELOAD 0x3E
#define USBINTSRC_OUT_EP_7_DMA_GO     0x3F
#define USBINTSRC_IN_EP_1_DMA_RELOAD  0x42
#define USBINTSRC_IN_EP_1_DMA_GO      0x43
#define USBINTSRC_IN_EP_2_DMA_RELOAD  0x44
#define USBINTSRC_IN_EP_2_DMA_GO      0x45
#define USBINTSRC_IN_EP_3_DMA_RELOAD  0x46
#define USBINTSRC_IN_EP_3_DMA_GO      0x47
#define USBINTSRC_IN_EP_4_DMA_RELOAD  0x48
#define USBINTSRC_IN_EP_4_DMA_GO      0x49
#define USBINTSRC_IN_EP_5_DMA_RELOAD  0x4A
#define USBINTSRC_IN_EP_5_DMA_GO      0x4B
#define USBINTSRC_IN_EP_6_DMA_RELOAD  0x4C
#define USBINTSRC_IN_EP_6_DMA_GO      0x4D
#define USBINTSRC_IN_EP_7_DMA_RELOAD  0x4E
#define USBINTSRC_IN_EP_7_DMA_GO      0x4F
#define USBINTSRC_HOST_INT            0x50
#define USBINTSRC_HOST_ERROR          0x52
//------------------------------------------------------------------------------
// USBCTL
//------------------------------------------------------------------------------
#define USBCTL_CONN        0x80
#define USBCTL_FEN         0x40
#define USBCTL_RWUP        0x20
#define USBCTL_FRSTE       0x10
#define USBCTL_SETUP       0x02
#define USBCTL_DIR         0x01
//------------------------------------------------------------------------------
// USBIDLECTL
//------------------------------------------------------------------------------
#define USBIDLECTL_USBRST    0x04
#define USBIDLECTL_IDLESTAT  0x02
#define USBIDLECTL_IDLEEN    0x01
//------------------------------------------------------------------------------
// USBxCNFn
//------------------------------------------------------------------------------
#define USBCNF_UBME         0x80
#define USBCNF_ISO          0x40
#define USBCNF_TOGGLE       0x20
#define USBCNF_DBUF         0x10
#define USBCNF_STALL        0x08
#define USBCNF_CTXH(h)      ((h)<<3)
#define USBCNF_CTYH(h)       (h)
//------------------------------------------------------------------------------
// USBxCTn
//------------------------------------------------------------------------------
#define USBCT_NACK          0x80
//------------------------------------------------------------------------------
// USB Interrupt Enable Register (USBIE)
//------------------------------------------------------------------------------
#define USBIE_RSTR          0x80
#define USBIE_SUSR          0x40
#define USBIE_RESR          0x20
#define USBIE_SOF           0x10
#define USBIE_PSOF          0x08
#define USBIE_SETUP         0x04
#define USBIE_STPOW         0x01
//------------------------------------------------------------------------------
// USB Interrupt Flag Register (USBIF)
//------------------------------------------------------------------------------
#define USBIF_RSTR          0x80
#define USBIF_SUSR          0x40
#define USBIF_RESR          0x20
#define USBIF_SOF           0x10
#define USBIF_PSOF          0x08
#define USBIF_SETUP         0x04
#define USBIF_STPOW         0x01

