avmwww/ittrium/config/tms320c55x/tms320c55x.h
#define USB_EP_DIR_IN       0x80
#define USB_EP_DIR_OUT      0x00
//------------------------------------------------------------------------------
// Descriptor Registers for Each OUT or IN Endpoint(1-7)
//------------------------------------------------------------------------------
// Endpoint n configuration register
#define USBOCNF(n)          (*(volatile ioport int*)(0x6700+(n)*8))
#define USBICNF(n)          (*(volatile ioport int*)(0x6740+(n)*8))
// X-buffer base address register (bits 11-4 of a byte address)
#define USBOBAX(n)          (*(volatile ioport int*)(0x6701+(n)*8))
#define USBIBAX(n)          (*(volatile ioport int*)(0x6741+(n)*8))
// X-buffer count register (transfer count in bytes)
#define USBOCTX(n)          (*(volatile ioport int*)(0x6702+(n)*8))
#define USBICTX(n)          (*(volatile ioport int*)(0x6742+(n)*8))
// X-buffer count extension register (used for isochronous transfers only)
#define USBOCTXH(n)         (*(volatile ioport int*)(0x6703+(n)*8))
// X-/Y-buffer size extension register (used for isochronous transfers only)
#define USBISIZH(n)         (*(volatile ioport int*)(0x6743+(n)*8))
// X-/Y-buffer size register (transfer size in bytes)
#define USBOSIZ(n)          (*(volatile ioport int*)(0x6704+(n)*8))
#define USBISIZ(n)          (*(volatile ioport int*)(0x6744+(n)*8))
// Y-buffer base address register (bits 11-4 of a byte address)
#define USBOBAY(n)          (*(volatile ioport int*)(0x6705+(n)*8))
#define USBIBAY(n)          (*(volatile ioport int*)(0x6745+(n)*8))
// Y-buffer count register (transfer count in bytes)
#define USBOCTY(n)          (*(volatile ioport int*)(0x6706+(n)*8))
#define USBICTY(n)          (*(volatile ioport int*)(0x6746+(n)*8))
// Y-buffer count extension register (used for isochronous transfers only)
#define USBOCTYH(n)         (*(volatile ioport int*)(0x6707+(n)*8))
//------------------------------------------------------------------------------
/*******************************************************************************
 GPIO module
 *******************************************************************************/
#define GPIO_IODIR     (*(volatile ioport int*)0x3400) // General-purpose I/O Register
#define GPIO_IODATA    (*(volatile ioport int*)0x3401) // General-purpose I/O Data Register
#define GPIO_AGPIOEN   (*(volatile ioport int*)0x4400) // Address/GPIO Enable Register
#define GPIO_AGPIODIR  (*(volatile ioport int*)0x4401) // Address/GPIO Direction Register
#define GPIO_AGPIODATA (*(volatile ioport int*)0x4402) // Address/GPIO Data Register
/*******************************************************************************
 MCBSP module
 *******************************************************************************/
#define DRR2  0x00
#define DRR1  0x01
#define DXR2  0x02
#define DXR1  0x03
#define SPCR2 0x04
#define SPCR1 0x05
#define RCR2  0x06
#define RCR1  0x07
#define XCR2  0x08
#define XCR1  0x09
#define SRGR2 0x0A
#define SRGR1 0x0B
#define MCR2  0x0C
#define MCR1  0x0D
#define RCERA 0x0E
#define RCERB 0x0F
#define XCERA 0x10
#define XCERB 0x11
#define PCR   0x12
#define RCERC 0x13
#define RCERD 0x14
#define XCERC 0x15
#define XCERD 0x16
#define RCERE 0x17
#define RCERF 0x18
#define XCERE 0x19
#define XCERF 0x1A
#define RCERG 0x1B
#define RCERH 0x1C
#define XCERG 0x1D
#define XCERH 0x1E
//
#define MCBSP0(r)    (*(volatile ioport int*)(0x2800 + (r)))
#define MCBSP1(r)    (*(volatile ioport int*)(0x2C00 + (r)))
#define MCBSP2(r)    (*(volatile ioport int*)(0x3000 + (r)))
// MCBSP0
#define MCBSP0_DRR2  (*(volatile ioport int*)0x2800) // Data Receive Register 2
#define MCBSP0_DRR1  (*(volatile ioport int*)0x2801) // Data Receive Register 1
#define MCBSP0_DXR2  (*(volatile ioport int*)0x2802) // Data Transmit Register 2
#define MCBSP0_DXR1  (*(volatile ioport int*)0x2803) // Data Transmit Register 1
#define MCBSP0_SPCR2 (*(volatile ioport int*)0x2804) // Serial Port Control Register 2
#define MCBSP0_SPCR1 (*(volatile ioport int*)0x2805) // Serial Port Control Register 1
#define MCBSP0_RCR2  (*(volatile ioport int*)0x2806) // Receive Control Register 2
#define MCBSP0_RCR1  (*(volatile ioport int*)0x2807) // Receive Control Register 1
#define MCBSP0_XCR2  (*(volatile ioport int*)0x2808) // Transmit Control Register 2
#define MCBSP0_XCR1  (*(volatile ioport int*)0x2809) // Transmit Control Register 1
#define MCBSP0_SRGR2 (*(volatile ioport int*)0x280A) // Sample Rate Generator Register 2
#define MCBSP0_SRGR1 (*(volatile ioport int*)0x280B) // Sample Rate Generator Register 1
#define MCBSP0_MCR2  (*(volatile ioport int*)0x280C) // Multichannel Register 2
#define MCBSP0_MCR1  (*(volatile ioport int*)0x280D) // Multichannel Register 1
#define MCBSP0_RCERA (*(volatile ioport int*)0x280E) // Receive Channel Enable Register Partition A
#define MCBSP0_RCERB (*(volatile ioport int*)0x280F) // Receive Channel Enable Register Partition B
#define MCBSP0_XCERA (*(volatile ioport int*)0x2810) // Transmit Channel Enable Register Partition A
#define MCBSP0_XCERB (*(volatile ioport int*)0x2811) // Transmit Channel Enable Register Partition B
#define MCBSP0_PCR   (*(volatile ioport int*)0x2812) // Pin Control Register
#define MCBSP0_RCERC (*(volatile ioport int*)0x2813) // Receive Channel Enable Register Partition C
#define MCBSP0_RCERD (*(volatile ioport int*)0x2814) // Receive Channel Enable Register Partition D
#define MCBSP0_XCERC (*(volatile ioport int*)0x2815) // Transmit Channel Enable Register Partition C
#define MCBSP0_XCERD (*(volatile ioport int*)0x2816) // Transmit Channel Enable Register Partition D
#define MCBSP0_RCERE (*(volatile ioport int*)0x2817) // Receive Channel Enable Register Partition E
#define MCBSP0_RCERF (*(volatile ioport int*)0x2818) // Receive Channel Enable Register Partition F
#define MCBSP0_XCERE (*(volatile ioport int*)0x2819) // Transmit Channel Enable Register Partition E
#define MCBSP0_XCERF (*(volatile ioport int*)0x281A) // Transmit Channel Enable Register Partition F
#define MCBSP0_RCERG (*(volatile ioport int*)0x281B) // Receive Channel Enable Register Partition G
#define MCBSP0_RCERH (*(volatile ioport int*)0x281C) // Receive Channel Enable Register Partition H
#define MCBSP0_XCERG (*(volatile ioport int*)0x281D) // Transmit Channel Enable Register Partition G
#define MCBSP0_XCERH (*(volatile ioport int*)0x281E) // Transmit Channel Enable Register Partition H
// MCBSP1
#define MCBSP1_DRR2  (*(volatile ioport int*)0x2C00) //  Data Receive Register 2
#define MCBSP1_DRR1  (*(volatile ioport int*)0x2C01) //  Data Receive Register 1
#define MCBSP1_DXR2  (*(volatile ioport int*)0x2C02) //  Data Transmit Register 2
#define MCBSP1_DXR1  (*(volatile ioport int*)0x2C03) //  Data Transmit Register 1
#define MCBSP1_SPCR2 (*(volatile ioport int*)0x2C04) //  Serial Port Control Register 2
#define MCBSP1_SPCR1 (*(volatile ioport int*)0x2C05) //  Serial Port Control Register 1
#define MCBSP1_RCR2  (*(volatile ioport int*)0x2C06) //  Receive Control Register 2
#define MCBSP1_RCR1  (*(volatile ioport int*)0x2C07) //  Receive Control Register 1
#define MCBSP1_XCR2  (*(volatile ioport int*)0x2C08) //  Transmit Control Register 2
#define MCBSP1_XCR1  (*(volatile ioport int*)0x2C09) //  Transmit Control Register 1
#define MCBSP1_SRGR2 (*(volatile ioport int*)0x2C0A) //  Sample Rate Generator Register 2
#define MCBSP1_SRGR1 (*(volatile ioport int*)0x2C0B) //  Sample Rate Generator Register 1
#define MCBSP1_MCR2  (*(volatile ioport int*)0x2C0C) //  Multichannel Register 2
#define MCBSP1_MCR1  (*(volatile ioport int*)0x2C0D) //  Multichannel Register 1
#define MCBSP1_RCERA (*(volatile ioport int*)0x2C0E) //  Receive Channel Enable Register Partition A
#define MCBSP1_RCERB (*(volatile ioport int*)0x2C0F) //  Receive Channel Enable Register Partition B
#define MCBSP1_XCERA (*(volatile ioport int*)0x2C10) //  Transmit Channel Enable Register Partition A
#define MCBSP1_XCERB (*(volatile ioport int*)0x2C11) //  Transmit Channel Enable Register Partition B
#define MCBSP1_PCR   (*(volatile ioport int*)0x2C12) //  Pin Control Register
#define MCBSP1_RCERC (*(volatile ioport int*)0x2C13) //  Receive Channel Enable Register Partition C
#define MCBSP1_RCERD (*(volatile ioport int*)0x2C14) //  Receive Channel Enable Register Partition D
#define MCBSP1_XCERC (*(volatile ioport int*)0x2C15) //  Transmit Channel Enable Register Partition C
#define MCBSP1_XCERD (*(volatile ioport int*)0x2C16) //  Transmit Channel Enable Register Partition D
#define MCBSP1_RCERE (*(volatile ioport int*)0x2C17) //  Receive Channel Enable Register Partition E
#define MCBSP1_RCERF (*(volatile ioport int*)0x2C18) //  Receive Channel Enable Register Partition F
#define MCBSP1_XCERE (*(volatile ioport int*)0x2C19) //  Transmit Channel Enable Register Partition E
#define MCBSP1_XCERF (*(volatile ioport int*)0x2C1A) //  Transmit Channel Enable Register Partition F
#define MCBSP1_RCERG (*(volatile ioport int*)0x2C1B) //  Receive Channel Enable Register Partition G
#define MCBSP1_RCERH (*(volatile ioport int*)0x2C1C) //  Receive Channel Enable Register Partition H
#define MCBSP1_XCERG (*(volatile ioport int*)0x2C1D) //  Transmit Channel Enable Register Partition G
#define MCBSP1_XCERH (*(volatile ioport int*)0x2C1E) //  Transmit Channel Enable Register Partition H
// MCBSP2
#define MCBSP2_DRR2  (*(volatile ioport int*)0x3000) //  Data Receive Register 2
#define MCBSP2_DRR1  (*(volatile ioport int*)0x3001) //  Data Receive Register 1
#define MCBSP2_DXR2  (*(volatile ioport int*)0x3002) //  Data Transmit Register 2
#define MCBSP2_DXR1  (*(volatile ioport int*)0x3003) //  Data Transmit Register 1
#define MCBSP2_SPCR2 (*(volatile ioport int*)0x3004) //  Serial Port Control Register 2
#define MCBSP2_SPCR1 (*(volatile ioport int*)0x3005) //  Serial Port Control Register 1
#define MCBSP2_RCR2  (*(volatile ioport int*)0x3006) //  Receive Control Register 2
#define MCBSP2_RCR1  (*(volatile ioport int*)0x3007) //  Receive Control Register 1
#define MCBSP2_XCR2  (*(volatile ioport int*)0x3008) //  Transmit Control Register 2
#define MCBSP2_XCR1  (*(volatile ioport int*)0x3009) //  Transmit Control Register 1
#define MCBSP2_SRGR2 (*(volatile ioport int*)0x300A) //  Sample Rate Generator Register 2
#define MCBSP2_SRGR1 (*(volatile ioport int*)0x300B) //  Sample Rate Generator Register 1
#define MCBSP2_MCR2  (*(volatile ioport int*)0x300C) //  Multichannel Register 2
#define MCBSP2_MCR1  (*(volatile ioport int*)0x300D) //  Multichannel Register 1
#define MCBSP2_RCERA (*(volatile ioport int*)0x300E) //  Receive Channel Enable Register Partition A
#define MCBSP2_RCERB (*(volatile ioport int*)0x300F) //  Receive Channel Enable Register Partition B
#define MCBSP2_XCERA (*(volatile ioport int*)0x3010) //  Transmit Channel Enable Register Partition A
#define MCBSP2_XCERB (*(volatile ioport int*)0x3011) //  Transmit Channel Enable Register Partition B
#define MCBSP2_PCR   (*(volatile ioport int*)0x3012) //  Pin Control Register
#define MCBSP2_RCERC (*(volatile ioport int*)0x3013) //  Receive Channel Enable Register Partition C
#define MCBSP2_RCERD (*(volatile ioport int*)0x3014) //  Receive Channel Enable Register Partition D
#define MCBSP2_XCERC (*(volatile ioport int*)0x3015) //  Transmit Channel Enable Register Partition C
#define MCBSP2_XCERD (*(volatile ioport int*)0x3016) //  Transmit Channel Enable Register Partition D
#define MCBSP2_RCERE (*(volatile ioport int*)0x3017) //  Receive Channel Enable Register Partition E
#define MCBSP2_RCERF (*(volatile ioport int*)0x3018) //  Receive Channel Enable Register Partition F
#define MCBSP2_XCERE (*(volatile ioport int*)0x3019) //  Transmit Channel Enable Register Partition E
#define MCBSP2_XCERF (*(volatile ioport int*)0x301A) //  Transmit Channel Enable Register Partition F
#define MCBSP2_RCERG (*(volatile ioport int*)0x301B) //  Receive Channel Enable Register Partition G
#define MCBSP2_RCERH (*(volatile ioport int*)0x301C) //  Receive Channel Enable Register Partition H
#define MCBSP2_XCERG (*(volatile ioport int*)0x301D) //  Transmit Channel Enable Register Partition G
#define MCBSP2_XCERH (*(volatile ioport int*)0x301E) //  Transmit Channel Enable Register Partition H
//------------------------------------------------------------------------------
// SPCR1 register
//------------------------------------------------------------------------------
#define SPCR1_DLB                  0x8000
#define SPCR1_RJUST_RIGHT_ZERRO    0x0000
#define SPCR1_RJUST_RIGHT_SIGN     0x2000
#define SPCR1_RJUST_LEFT_ZERRO     0x4000
#define SPCR1_RJUST_LEFT_SIGN      0x6000
#define SPCR1_CLKSTP_DISABLE       0x0000
#define SPCR1_CLKSTP_WO_CLK_DLY    0x1000
#define SPCR1_CLKSTP_HALF_CLK_DLY  0x1800
#define SPCR1_DXENA                0x0080
#define SPCR1_ABIS                 0x0040
#define SPCR1_RINTM_RRDY           0x0000
#define SPCR1_RINTM_16_CHAN_BLOCK  0x0010
#define SPCR1_RINTM_FRAME_SYNC     0x0020
#define SPCR1_RINTM_RSYNCERR       0x0030
#define SPCR1_RSYNCERR             0x0008
#define SPCR1_RFULL                0x0004
#define SPCR1_RRDY                 0x0002
#define SPCR1_RRST_                0x0001
// bits
#define _SPCR1_RRDY                1
//-------------------------------------------------------------------------------
// SPCR2 register
//-------------------------------------------------------------------------------
#define SPCR2_FREE                 0x0200
#define SPCR2_SOFT                 0x0100
#define SPCR2_FRST_                0x0080
#define SPCR2_GRST_                0x0040
#define SPCR2_XINTM_XRDY           0x0000
#define SPCR2_XINTM_16_CHAN_BLOCK  0x0010
#define SPCR2_XINTM_FRAME_SYNC     0x0020
#define SPCR2_XINTM_XSYNCERR       0x0030
#define SPCR2_XSYNCERR             0x0008
#define SPCR2_XEMPTY_              0x0004
#define SPCR2_XRDY                 0x0002
#define SPCR2_XRST_                0x0001
// bits
#define _SPCR2_XRDY                1
//-------------------------------------------------------------------------------
// RCR1
//-------------------------------------------------------------------------------
#define RCR1_RFRLEN1(v)           ((v)<<8)
#define RCR1_RWDLEN1_8            0x0000
#define RCR1_RWDLEN1_12           0x0020
#define RCR1_RWDLEN1_16           0x0040
#define RCR1_RWDLEN1_20           0x0060
#define RCR1_RWDLEN1_24           0x0080
#define RCR1_RWDLEN1_32           0x00A0
//------------------------------------------------------------------------------
// RCR2
//------------------------------------------------------------------------------
#define RCR2_RPHASE                0x8000
#define RCR2_RFRLEN2(v)            ((v)<<8)
#define RCR2_RWDLEN2_8             0x0000
#define RCR2_RWDLEN2_12            0x0020
#define RCR2_RWDLEN2_16            0x0040
#define RCR2_RWDLEN2_20            0x0060
#define RCR2_RWDLEN2_24            0x0080
#define RCR2_RWDLEN2_32            0x00A0
#define RCR2_RCOMPAND_NO_COMP_MSB  0x0000
#define RCR2_RCOMPAND_NO_COMP_LSB  0x0008
#define RCR2_RCOMPAND_MU_LAW       0x0010
#define RCR2_RCOMPAND_A_LAW        0x0018
#define RCR2_RFIG                  0x0004
#define RCR2_RDATDLY_0_BIT         0x0000
#define RCR2_RDATDLY_1_BIT         0x0001
#define RCR2_RDATDLY_2_BIT         0x0002
//------------------------------------------------------------------------------
// XCR1
//------------------------------------------------------------------------------
#define XCR1_XFRLEN1(v)            ((v)<<8)
#define XCR1_XWDLEN1_8             0x0000
#define XCR1_XWDLEN1_12            0x0020
#define XCR1_XWDLEN1_16            0x0040
#define XCR1_XWDLEN1_20            0x0060
#define XCR1_XWDLEN1_24            0x0080
#define XCR1_XWDLEN1_32            0x00A0
//------------------------------------------------------------------------------
// XCR2
//------------------------------------------------------------------------------
#define XCR2_XPHASE                0x8000
#define XCR2_XFRLEN2(v)           ((v)<<8)
#define XCR2_XWDLEN2_8             0x0000
#define XCR2_XWDLEN2_12            0x0020
#define XCR2_XWDLEN2_16            0x0040
#define XCR2_XWDLEN2_20            0x0060
#define XCR2_XWDLEN2_24            0x0080
#define XCR2_XWDLEN2_32            0x00A0
#define XCR2_XCOMPAND_NO_COMP_MSB  0x0000
#define XCR2_XCOMPAND_NO_COMP_LSB  0x0008
#define XCR2_XCOMPAND_MU_LAW       0x0010
#define XCR2_XCOMPAND_A_LAW        0x0018
#define XCR2_XFIG                  0x0004
#define XCR2_XDATDLY_0_BIT         0x0000
#define XCR2_XDATDLY_1_BIT         0x0001
#define XCR2_XDATDLY_2_BIT         0x0002
//------------------------------------------------------------------------------
// SRGR1
//------------------------------------------------------------------------------
#define SRGR1_FWID(v)     ((v)<<8)
#define SRGR1_CLKGDV(v)   (v)
//------------------------------------------------------------------------------
// SRGR2
//------------------------------------------------------------------------------
#define SRGR2_GSYNC                0x8000
#define SRGR2_CLKSP                0x4000
#define SRGR2_CLKSM                0x2000
#define SRGR2_FSGM                 0x1000
#define SRGR2_FPER(v)              (v)
//------------------------------------------------------------------------------
// MCR1
//------------------------------------------------------------------------------
#define MCR1_RMCME                 0x0200
#define MCR1_RPBBLK_1              0x0000
#define MCR1_RPBBLK_3              0x0080
#define MCR1_RPBBLK_5              0x0100
#define MCR1_RPBBLK_7              0x0180
#define MCR1_RPABLK_0              0x0000
#define MCR1_RPABLK_2              0x0020
#define MCR1_RPABLK_4              0x0040
#define MCR1_RPABLK_6              0x0060
#define MCR1_RCBLK_0               0x0000
#define MCR1_RCBLK_1               0x0004
#define MCR1_RCBLK_2               0x0008
#define MCR1_RCBLK_3               0x000C
#define MCR1_RCBLK_4               0x0010
#define MCR1_RCBLK_5               0x0014
#define MCR1_RCBLK_6               0x0018
#define MCR1_RCBLK_7               0x001C
#define MCR1_RMCM                  0x0001
//-------------------------------------------------------------------------------
// MCR2
//-------------------------------------------------------------------------------
#define MCR2_XMCME                 0x0200
#define MCR2_XPBBLK_1              0x0000
#define MCR2_XPBBLK_3              0x0080
#define MCR2_XPBBLK_5              0x0100
#define MCR2_XPBBLK_7              0x0180
#define MCR2_XPABLK_0              0x0000
#define MCR2_XPABLK_2              0x0020
#define MCR2_XPABLK_4              0x0040
#define MCR2_XPABLK_6              0x0060
#define MCR2_XCBLK_0               0x0000
#define MCR2_XCBLK_1               0x0004
#define MCR2_XCBLK_2               0x0008
#define MCR2_XCBLK_3               0x000C
#define MCR2_XCBLK_4               0x0010
#define MCR2_XCBLK_5               0x0014
#define MCR2_XCBLK_6               0x0018
#define MCR2_XCBLK_7               0x001C
// TODO XMCM bits 1-0
#define MCR2_XMCM                  0x0001
//------------------------------------------------------------------------------
// PCR
//------------------------------------------------------------------------------
#define PCR_IDLE_EN                0x4000
#define PCR_XIOEN                  0x2000
#define PCR_RIOEN                  0x1000
#define PCR_FSXM                   0x0800
#define PCR_FSRM                   0x0400
#define PCR_CLKXM                  0x0200
#define PCR_CLKRM                  0x0100
#define PCR_SCLKME                 0x0080
#define PCR_CLKS_STAT              0x0040
#define PCR_DX_STAT                0x0020
#define PCR_DR_STAT                0x0010
#define PCR_FSXP                   0x0008
#define PCR_FSRP                   0x0004
#define PCR_CLKXP                  0x0002
#define PCR_CLKRP                  0x0001
/*******************************************************************************
 DMA module
 *******************************************************************************/
#define CSDP  	0x00
#define CCR   	0x01
#define CICR  	0x02
#define CSR   	0x03
#define CSSA_L	0x04
#define CSSA_U 	0x05
#define CDSA_L  0x06
#define CDSA_U  0x07
#define CEN  	0x08
#define CFN  	0x09
#define CFI 	0x0A
#define CEI 	0x0B
//
#define DMA0(r)    (*(volatile ioport int*)(0x0C00 + (r)))
#define DMA1(r)    (*(volatile ioport int*)(0x0C20 + (r)))
#define DMA2(r)    (*(volatile ioport int*)(0x0C40 + (r)))
#define DMA3(r)    (*(volatile ioport int*)(0x0C60 + (r)))
#define DMA4(r)    (*(volatile ioport int*)(0x0C80 + (r)))
#define DMA5(r)    (*(volatile ioport int*)(0x0CA0 + (r)))

