avmwww/ittrium/config/tms320c55x/tms320c55x.h
#define DMA_GCR  	(*(volatile ioport int*)(0x0E00))
#define DMA_GTCR  	(*(volatile ioport int*)(0x0E03))
//-------------------------------------------------------------------------------
#define ENABLE_DMA0_INT()             asm("     OR #0x0004, *(IER1)");
#define DISABLE_DMA0_INT()            asm("     AND #0xFFFB, *(IER1)");
#define CLEAR_DMA0_INT()              asm("     OR #0x0004, *(IFR1)");
//-------------------------------------------------------------------------------
#define ENABLE_DMA1_INT()             asm("     OR #0x0200, *(IER0)");
#define DISABLE_DMA1_INT()            asm("     AND #0xFDFF, *(IER0)");
#define CLEAR_DMA1_INT()              asm("     OR #0x0200, *(IFR0)");
//-------------------------------------------------------------------------------
#define ENABLE_DMA2_INT()             asm("     OR #0x0010, *(IER1)");
#define DISABLE_DMA2_INT()            asm("     AND #0xFFEF, *(IER1)");
#define CLEAR_DMA2_INT()              asm("     OR #0x0010, *(IFR1)");
//-------------------------------------------------------------------------------
#define ENABLE_DMA3_INT()             asm("     OR #0x0020, *(IER1)");
#define DISABLE_DMA3_INT()            asm("     AND #0xFFDF, *(IER1)");
#define CLEAR_DMA3_INT()              asm("     OR #0x0020, *(IFR1)");
//-------------------------------------------------------------------------------
#define ENABLE_DMA4_INT()             asm("     OR #0x4000, *(IER0)");
#define DISABLE_DMA4_INT()            asm("     AND #0xBFFF, *(IER0)");
#define CLEAR_DMA4_INT()              asm("     OR #0x4000, *(IFR0)");
//-------------------------------------------------------------------------------
#define ENABLE_DMA5_INT()             asm("     OR #0x8000, *(IER0)");
#define DISABLE_DMA5_INT()            asm("     AND #0x7FFF, *(IER0)");
#define CLEAR_DMA5_INT()              asm("     OR #0x8000, *(IFR0)");
//-------------------------------------------------------------------------------
//-------------------------------------------------------------------------------
// GCR
//-------------------------------------------------------------------------------
#define GCR_FREE        0x0004
#define GCR_EHPI_EXCL   0x0002
#define GCR_EHPI_PRIO   0x0001
//-------------------------------------------------------------------------------
// CCR
//-------------------------------------------------------------------------------
#define CCR_DST_AMODE_CONST        0x0000
#define CCR_DST_AMODE_AUTO_INC     0x4000
#define CCR_DST_AMODE_SINGLE_IDX   0x8000
#define CCR_DST_AMODE_DOUBLE_IDX   0xC000
#define CCR_SRC_AMODE_CONST        0x0000
#define CCR_SRC_AMODE_AUTO_INC     0x1000
#define CCR_SRC_AMODE_SINGLE_IDX   0x2000
#define CCR_SRC_AMODE_DOUBLE_IDX   0x3000
#define CCR_END_PROG               0x0800
#define CCR_FIFO_FLUSH             0x0400
#define CCR_REPEAT                 0x0200
#define CCR_AUTOINIT               0x0100
#define CCR_EN                     0x0080
#define CCR_PRIO                   0x0040
#define CCR_FS                     0x0020
#define CCR_SYNC_NO                0x0000
#define CCR_SYNC_MCBSP0_RX         0x0001
#define CCR_SYNC_MCBSP0_TX         0x0002
#define CCR_SYNC_MCBSP1_RX         0x0005
#define CCR_SYNC_MCBSP1_TX         0x0006
#define CCR_SYNC_MCBSP2_RX         0x0009
#define CCR_SYNC_MCBSP2_TX         0x000A
#define CCR_SYNC_TIMER1            0x000D
#define CCR_SYNC_TIMER2            0x000E
#define CCR_SYNC_EXT_INT0          0x000F
#define CCR_SYNC_EXT_INT1          0x0010
#define CCR_SYNC_EXT_INT2          0x0011
#define CCR_SYNC_EXT_INT3          0x0012
#define CCR_SYNC_I2C_RX            0x0013
#define CCR_SYNC_I2C_TX            0x0014
//-------------------------------------------------------------------------------
// CSDP
//-------------------------------------------------------------------------------
#define CSDP_DST_BEN               
#define CSDP_DST_PACK              
#define CSDP_DST_SARAM             0x0000
#define CSDP_DST_DARAM             0x0200
#define CSDP_DST_EMIF              0x0400
#define CSDP_DST_IOPORT            0x0600
#define CSDP_SRC_BEN               
#define CSDP_SRC_PACK              
#define CSDP_SRC_SARAM             0x0000
#define CSDP_SRC_DARAM             0x0004
#define CSDP_SRC_EMIF              0x0008
#define CSDP_SRC_IOPORT            0x000C
#define CSDP_DATA_TYPE_8           0x0000
#define CSDP_DATA_TYPE_16          0x0001
#define CSDP_DATA_TYPE_32          0x0002
//-------------------------------------------------------------------------------
// CICR
//-------------------------------------------------------------------------------
#define CICR_BLOCK_IE              0x0020
#define CICR_LAST_IE               0x0010
#define CICR_FRAME_IE              0x0008
#define CICR_HALF_IE               0x0004
#define CICR_DROP_IE               0x0002
#define CICR_TIMEOUT               0x0001
// bits
#define _CICR_BLOCK_IE              5
#define _CICR_LAST_IE               4
#define _CICR_FRAME_IE              3
#define _CICR_HALF_IE               2
#define _CICR_DROP_IE               1
#define _CICR_TIMEOUT               0
//-------------------------------------------------------------------------------
// CSR
//-------------------------------------------------------------------------------
// bits
#define _CSR_BLOCK_IE               5
#define _CSR_LAST_IE                4
#define _CSR_FRAME_IE               3
#define _CSR_HALF_IE                2
#define _CSR_DROP_IE                1
#define _CSR_TIMEOUT                0

/*******************************************************************************
 * Watchdog Timer Registers                                                    *
 *******************************************************************************/
#define WDTIM            (*(volatile ioport int*)0x4000)   // WD Timer Counter Register
#define WDPRD            (*(volatile ioport int*)0x4001)   // WD Timer Period Register
#define WDTCR            (*(volatile ioport int*)0x4002)   // WD Timer Control Register
#define WDTCR2           (*(volatile ioport int*)0x4003)   // WD Timer Control Register 2

#define WDKEY1           0x05C6
#define WDKEY2           0x0A7E
/*******************************************************************************
 Vectors
 *******************************************************************************/
#define RESET_VECNO      0       // Reset (hardware and software)
#define NMI_VECNO        1       // Nonmaskable interrupt
#define INT0_VECNO       2       // External interrupt #0
#define INT2_VECNO       3       // External interrupt #2
#define TINT0_VECNO      4       // Timer #0 interrupt
#define RINT0_VECNO      5       // McBSP #0 receive interrupt
#define RINT1_VECNO      6       // McBSP #1 receive interrupt
#define XINT1_VECNO      7       // McBSP #1 transmit interrupt
#define MMCSD1_VECNO     7       // MMC/SD #1 interrupt
#define USB_VECNO        8       // USB interrupt
#define DMAC1_VECNO      9       // DMA Channel #1 interrupt
#define DSPINT_VECNO    10       // Interrupt from host
#define INT3_VECNO      11       // External interrupt #3
#define WDTINT_VECNO    11       // Watchdog timer interrupt
#define RINT2_VECNO     12       // McBSP #2 receive interrupt
#define XINT2_VECNO     13       // McBSP #2 transmit interrupt
#define MMCSD2_VECNO    13       // MMC/SD #2 interrupt
#define DMAC4_VECNO     14       // DMA Channel #4 interrupt
#define DMAC5_VECNO     15       // DMA Channel #5 interrupt
#define INT1_VECNO      16       // External interrupt #1
#define XINT0_VECNO     17       // McBSP #0 transmit interrupt
#define DMAC0_VECNO     18       // DMA Channel #0 interrupt
#define INT4_VECNO      19       // External interrupt #4
#define RTC_VECNO       19       // RTC interrupt
#define DMAC2_VECNO     20       // DMA Channel #2 interrupt
#define DMAC3_VECNO     21       // DMA Channel #3 interrupt
#define TINT1_VECNO     22       // Timer #1 interrupt
#define I2C_VECNO       23       // I2C interrupt
#define BERR_VECNO      24       // Bus Error interrupt
#define DLOG_VECNO      25       // Data Log interrupt
#define RTOS_VECNO      26       // Real-time Operating System interrupt
#define SINT27_VECNO    27       // Software interrupt #27
#define SINT28_VECNO    28       // Software interrupt #28
#define SINT29_VECNO    29       // Software interrupt #29
#define SINT30_VECNO    30       // Software interrupt #30
#define SINT31_VECNO    31       // Software interrupt #31

#endif // _TMS320C55_H_
